nc: 80

depth_multiple: 0.50
width_multiple: 1.00
max_channels: 512

scales:
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024] 
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.50, 512]

# YOLO11n backbone (Swin → MaxViT)
# Backbone (lighter MaxViT usage)
backbone:
  - [-1, 1, Conv,        [64, 3, 2]]           # Initial convolution, output 64 channels, stride 2
  - [-1, 1, Conv,        [128, 3, 2]]          # Downsample, output 128 channels, stride 2
  - [-1, 2, C2f,         [256, True]]          # C2f block, output 256 channels, 2 repeats
  - [-1, 1, Conv,        [256, 3, 2]]          # Downsample, output 256 channels, stride 2
  - [-1, 2, C2f,         [512, True]]          # C2f block, output 512 channels, 2 repeats
  - [-1, 1, Conv,        [512, 3, 2]]          # Downsample, output 512 channels, stride 2
  - [-1, 1, MaxViTCNNBlock, [512, [16,16]]]    # MaxViT block, 512 channels, window size 16x16
  - [-1, 1, Conv,        [1024, 3, 2]]         # Downsample, output 1024 channels, stride 2
  - [-1, 1, MaxViTCNNBlock, [1024, [8,8]]]     # MaxViT block, 1024 channels, window size 8x8
  - [-1, 1, SPPF,        [1024, 5]]            # Spatial Pyramid Pooling Fast, output 1024 channels
  - [-1, 2, C2PSA,       [1024]]               # C2PSA block, output 1024 channels, 2 repeats

# Head (transformer only for large scale features)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsample by factor of 2 (nearest neighbor)
  - [[-1, 6], 1, Concat, [1]]                  # Concatenate upsampled features with backbone layer 6
  - [-1, 2, C3k2, [512, False]]                # C3k2 block, output 512 channels, 2 repeats, no transformer

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsample by factor of 2
  - [[-1, 4], 1, Concat, [1]]                  # Concatenate upsampled features with backbone layer 4
  - [-1, 2, C3k2, [256, False]]                # C3k2 block, output 256 channels, 2 repeats, no transformer

  - [-1, 1, Conv, [256, 3, 2]]                 # Downsample, output 256 channels, stride 2
  - [[-1, 13], 1, Concat, [1]]                 # Concatenate with head layer 13
  - [-1, 2, C3TR, [512, False]]                # C3TR block, output 512 channels, 2 repeats, transformer

  - [-1, 1, Conv, [512, 3, 2]]                 # Downsample, output 512 channels, stride 2
  - [[-1, 10], 1, Concat, [1]]                 # Concatenate with backbone layer 10
  - [-1, 2, C3TR, [1024, True]]                # C3TR block, output 1024 channels, 2 repeats, transformer enabled

  - [[16, 19, 22], 1, Detect, [nc]]            # Detection head, uses outputs from layers 16, 19, 22

  # higher and bigger image thats why c3tr with global context but slower  
  # smaller and faster image thats why c3k2 with local context but